<h2>OVERVIEW DOS DATASETS</h2>

In [ ]:
import pandas as pd

In [2]:
#TRAIN.CSV: Tabular/text data for the training set ------------------------------------------------------------------------####
train = pd.read_csv('datasets/train.csv', delimiter=',')
train.sample(2)

,Type,Name,Age,Breed1,Breed2,Gender,Color1,Color2,Color3,MaturitySize,...,Health,Quantity,Fee,State,RescuerID,VideoAmt,Description,PetID,PhotoAmt,AdoptionSpeed
1852,1,Hercules,3,307,307,1,1,0,0,2,...,1,1,0,41326,95481e953f8aed9ec3d16fc4509537e8,0,A litter of pups were found in a pipeline & bu...,183c947eb,5.0,2
13649,1,Bernadette And Dusty,2,307,0,2,2,5,7,1,...,1,2,200,41326,2864803699884df90ac135583b02ec70,0,"Two adorable female pups, fluffy and soft, cud...",08b7e05a5,1.0,2

In [3]:
#lines
train.shape[0]

14993

In [4]:
#columns
train.shape[1]

24

<h3>TRAIN.CSV: Tabular/text data for the training set</h3>
<h4>3972 linhas e 23 colunas</h4>

In [6]:
test = pd.read_csv('datasets/test.csv', delimiter=',')
test.sample(2)

,Type,Name,Age,Breed1,Breed2,Gender,Color1,Color2,Color3,MaturitySize,...,Sterilized,Health,Quantity,Fee,State,RescuerID,VideoAmt,Description,PetID,PhotoAmt
1206,1,Tang Ka Chee,7,307,0,2,1,2,0,2,...,1,1,1,0,41401,cc1cb7596b863ab9b0fbeb7cf2702015,0,I am only a volunteer from Second Chance dog s...,f9a88940b,6.0
2824,2,Lucky Oreo (Lux),30,266,0,2,1,7,0,2,...,2,1,1,0,41326,f279c97bf817e4b376a9da1d2c18ae8e,0,Hi. I'm moving residence and am looking for a ...,75dc341b8,2.0

In [7]:
test.shape[0]

3972

In [8]:
test.shape[1]

23

<h3>SAMPLE_SUBMISSION.CSV: A sample submission file in the correct format</h3> 
<h4>3972 linhas e 2 colunas</h4>

In [17]:
sample_submission = pd.read_csv('datasets/sample_submission.csv', delimiter=',')
sample_submission.sample(3)

          PetID  AdoptionSpeed
1335  313a56b49              0
681   af8dcfa6f              0
2228  13529cfa1              0

In [18]:
sample_submission.shape[0]

3972

In [19]:
sample_submission.shape[1]

2

In [24]:
breed_labels = pd.read_csv('datasets/breed_labels.csv', delimiter=',')
breed_labels.sample(3)

     BreedID  Type       BreedName
59        60     1       Chihuahua
247      247     2          Bengal
218      219     1  Thai Ridgeback

In [21]:
breed_labels.shape[0]

307

In [22]:
breed_labels.shape[1]

3

<h3>COLOR_LABELS.CSV: Contains ColorName for each ColorID</h3> 
<h4>7 linhas e 2 colunas/h4>

In [35]:
color_labels = pd.read_csv('datasets/color_labels.csv', delimiter=',')
color_labels

   ColorID ColorName
0        1     Black
1        2     Brown
2        3    Golden
3        4    Yellow
4        5     Cream
5        6      Gray
6        7     White

In [30]:
color_labels.shape[0]

7

In [34]:
color_labels.shape[1]

2

<h3>STATE_LABELS.CSV:  Contains StateName for each StateID</h3> 
<h4>15 linhas e 2 colunas/h4>

In [37]:
state_labels = pd.read_csv('datasets/state_labels.csv', delimiter=',')
state_labels.sample(3)

    StateID StateName
13    41326  Selangor
0     41336     Johor
7     41335    Pahang

In [38]:
state_labels.shape[0]

15

In [39]:
state_labels.shape[1]

2